[Killed] BooleanLiteral
src/modules/GameWithHooks/useGame.ts:38:54
   const [reset, setReset] = useState(0);
   const [gameState, setGameState] = useState(GameState.ONGOING);
   const [timer, setTimer] = useState(0);
-  const [gameIsStarted, setGameIsStarted] = useState(false);
+  const [gameIsStarted, setGameIsStarted] = useState(true);
   const [flagCounter, setFlagCounter] = useState(0);
 
killedBy: useGame hook Scoreboard behaviour - timer and bomb counters Timer should start by click to a cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 5

[Survived] ArithmeticOperator
src/modules/GameWithHooks/useGame.ts:44:32
   let initialPlayerField: Field = emptyFieldGenerator(size, CellState.hidden);
   const [playerField, setPlayerField] = useState<Field>(initialPlayerField);
   let gameField: Field = useMemo(
-    () => fieldGenerator(size, bombs / (size * size)),
+    () => fieldGenerator(size, bombs * (size * size)),
     [size, bombs, reset]
   );

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:48:19
     [size, bombs, reset]
   );
 
-  useEffect(() => {
-    let it: any = null;
-    if (gameIsStarted) {
-      it = setTimeout(() => {
-        setTimer(timer + 1);
-      }, 1000);
-
-      if (gameState === GameState.LOST || gameState === GameState.WON)
-        clearInterval(it);
-    }
-
-    return () => {
-      clearInterval(it);
-    };
-  }, [gameIsStarted, gameState, timer]);
+  useEffect(() => {}, [gameIsStarted, gameState, timer]);
 
   const handleClick = (coords: Coords) => {
killedBy: useGame hook Scoreboard behaviour - timer and bomb counters Timer should start by click to a cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/modules/GameWithHooks/useGame.ts:50:9
 
   useEffect(() => {
     let it: any = null;
-    if (gameIsStarted) {
+    if (false) {
       it = setTimeout(() => {
         setTimer(timer + 1);
killedBy: useGame hook Scoreboard behaviour - timer and bomb counters Timer should start by click to a cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
src/modules/GameWithHooks/useGame.ts:50:9
 
   useEffect(() => {
     let it: any = null;
-    if (gameIsStarted) {
+    if (true) {
       it = setTimeout(() => {
         setTimer(timer + 1);
killedBy: useGame hook Scoreboard behaviour - timer and bomb counters Timer should start by click to a cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 5

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:51:29
   useEffect(() => {
     let it: any = null;
     if (gameIsStarted) {
-      it = setTimeout(() => {
-        setTimer(timer + 1);
-      }, 1000);
+      it = setTimeout(() => {}, 1000);
 
       if (gameState === GameState.LOST || gameState === GameState.WON)
killedBy: useGame hook Scoreboard behaviour - timer and bomb counters Timer should start by click to a cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ArithmeticOperator
src/modules/GameWithHooks/useGame.ts:52:18
     let it: any = null;
     if (gameIsStarted) {
       it = setTimeout(() => {
-        setTimer(timer + 1);
+        setTimer(timer - 1);
       }, 1000);
 
killedBy: useGame hook Scoreboard behaviour - timer and bomb counters Timer should start by click to a cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: -5

[Killed] EqualityOperator
src/modules/GameWithHooks/useGame.ts:55:43
         setTimer(timer + 1);
       }, 1000);
 
-      if (gameState === GameState.LOST || gameState === GameState.WON)
+      if (gameState === GameState.LOST || gameState !== GameState.WON)
         clearInterval(it);
     }
killedBy: useGame hook Scoreboard behaviour - timer and bomb counters Timer should start by click to a cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] EqualityOperator
src/modules/GameWithHooks/useGame.ts:55:11
         setTimer(timer + 1);
       }, 1000);
 
-      if (gameState === GameState.LOST || gameState === GameState.WON)
+      if (gameState !== GameState.LOST || gameState === GameState.WON)
         clearInterval(it);
     }
killedBy: useGame hook Scoreboard behaviour - timer and bomb counters Timer should start by click to a cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:59:18
         clearInterval(it);
     }
 
-    return () => {
-      clearInterval(it);
-    };
+    return () => {};
   }, [gameIsStarted, gameState, timer]);
 
killedBy: useGame hook Scoreboard behaviour - timer and bomb counters Time should reset value when onReset have been called
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 6

[Killed] ArrayDeclaration
src/modules/GameWithHooks/useGame.ts:62:6
     return () => {
       clearInterval(it);
     };
-  }, [gameIsStarted, gameState, timer]);
+  }, []);
 
   const handleClick = (coords: Coords) => {
killedBy: useGame hook Scoreboard behaviour - timer and bomb counters Timer should start by click to a cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:64:43
     };
   }, [gameIsStarted, gameState, timer]);
 
-  const handleClick = (coords: Coords) => {
-    if (!gameIsStarted) setGameIsStarted(true);
-    if (gameState !== GameState.ONGOING) return;
-    try {
-      const newPlayerField = openCell(coords, playerField, gameField);
-      setPlayerField([...newPlayerField]);
-      setGameIsStarted(true);
-    } catch (e) {
-      setPlayerField([...gameField]);
-      setGameState(GameState.LOST);
-    }
-  };
+  const handleClick = (coords: Coords) => {};
 
   const createNewPlayerField = (level: LevelNames) => {
killedBy: useGame hook Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 75
Received length: 81

[Killed] BooleanLiteral
src/modules/GameWithHooks/useGame.ts:65:9
   }, [gameIsStarted, gameState, timer]);
 
   const handleClick = (coords: Coords) => {
-    if (!gameIsStarted) setGameIsStarted(true);
+    if (gameIsStarted) setGameIsStarted(true);
     if (gameState !== GameState.ONGOING) return;
     try {
killedBy: useGame hook Scoreboard behaviour - timer and bomb counters Timer should start by click to a cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 4

[Killed] BooleanLiteral
src/modules/GameWithHooks/useGame.ts:65:42
   }, [gameIsStarted, gameState, timer]);
 
   const handleClick = (coords: Coords) => {
-    if (!gameIsStarted) setGameIsStarted(true);
+    if (!gameIsStarted) setGameIsStarted(false);
     if (gameState !== GameState.ONGOING) return;
     try {
killedBy: useGame hook Scoreboard behaviour - timer and bomb counters Timer should start by click to a cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 4

[Killed] EqualityOperator
src/modules/GameWithHooks/useGame.ts:66:9
 
   const handleClick = (coords: Coords) => {
     if (!gameIsStarted) setGameIsStarted(true);
-    if (gameState !== GameState.ONGOING) return;
+    if (gameState === GameState.ONGOING) return;
     try {
       const newPlayerField = openCell(coords, playerField, gameField);
killedBy: useGame hook Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 75
Received length: 81

[Killed] ConditionalExpression
src/modules/GameWithHooks/useGame.ts:66:9
 
   const handleClick = (coords: Coords) => {
     if (!gameIsStarted) setGameIsStarted(true);
-    if (gameState !== GameState.ONGOING) return;
+    if (true) return;
     try {
       const newPlayerField = openCell(coords, playerField, gameField);
killedBy: useGame hook Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 75
Received length: 81

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:67:9
   const handleClick = (coords: Coords) => {
     if (!gameIsStarted) setGameIsStarted(true);
     if (gameState !== GameState.ONGOING) return;
-    try {
-      const newPlayerField = openCell(coords, playerField, gameField);
-      setPlayerField([...newPlayerField]);
-      setGameIsStarted(true);
-    } catch (e) {
+    try {} catch (e) {
       setPlayerField([...gameField]);
       setGameState(GameState.LOST);
killedBy: useGame hook Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 75
Received length: 81

[Killed] BooleanLiteral
src/modules/GameWithHooks/useGame.ts:70:24
     try {
       const newPlayerField = openCell(coords, playerField, gameField);
       setPlayerField([...newPlayerField]);
-      setGameIsStarted(true);
+      setGameIsStarted(false);
     } catch (e) {
       setPlayerField([...gameField]);
killedBy: useGame hook Scoreboard behaviour - timer and bomb counters Timer should start by click to a cell
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 1

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:71:17
       const newPlayerField = openCell(coords, playerField, gameField);
       setPlayerField([...newPlayerField]);
       setGameIsStarted(true);
-    } catch (e) {
-      setPlayerField([...gameField]);
-      setGameState(GameState.LOST);
-    }
+    } catch (e) {}
   };
 
killedBy: useGame hook Game over behavior Player loose the game
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 2
Received: 0

[Killed] ArrayDeclaration
src/modules/GameWithHooks/useGame.ts:80:20
   const createNewPlayerField = (level: LevelNames) => {
     const [size] = GameSettings[level];
     const newPlayerField = emptyFieldGenerator(size, CellState.hidden);
-    setPlayerField([...newPlayerField]);
+    setPlayerField([]);
   };
 
killedBy: useGame hook Render behaviour onChange game level handler
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 16
Received length: 0
Received array:  []

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:88:29
     createNewPlayerField(level);
   };
 
-  const handleReset = () => {
-    setReset(reset + 1);
-    setGameState(GameState.ONGOING);
-    setGameIsStarted(false);
-    setTimer(0);
-    createNewPlayerField(level);
-  };
+  const handleReset = () => {};
 
   const handleContextMenu = (coords: Coords) => {
killedBy: useGame hook onReset game handler
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 81
Received length: 75

[Killed] BooleanLiteral
src/modules/GameWithHooks/useGame.ts:91:22
   const handleReset = () => {
     setReset(reset + 1);
     setGameState(GameState.ONGOING);
-    setGameIsStarted(false);
+    setGameIsStarted(true);
     setTimer(0);
     createNewPlayerField(level);
killedBy: useGame hook Scoreboard behaviour - timer and bomb counters Time should reset value when onReset have been called
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 5

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:96:49
     createNewPlayerField(level);
   };
 
-  const handleContextMenu = (coords: Coords) => {
-    if (!gameIsStarted) setGameIsStarted(true);
-    if (gameState !== GameState.ONGOING) return;
-    const [newPlayerField, isSolved, flags] = setFlag(
-      coords,
-      playerField,
-      gameField,
-      flagCounter,
-      bombs
-    );
-    setFlagCounter(flags);
-    setPlayerField([...newPlayerField]);
-  };
+  const handleContextMenu = (coords: Coords) => {};
 
   useEffect(() => {
killedBy: useGame hook Scoreboard behaviour - timer and bomb counters Timer should start by mark a cell by a flag
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BooleanLiteral
src/modules/GameWithHooks/useGame.ts:97:42
   };
 
   const handleContextMenu = (coords: Coords) => {
-    if (!gameIsStarted) setGameIsStarted(true);
+    if (!gameIsStarted) setGameIsStarted(false);
     if (gameState !== GameState.ONGOING) return;
     const [newPlayerField, isSolved, flags] = setFlag(
killedBy: useGame hook Scoreboard behaviour - timer and bomb counters Timer should start by mark a cell by a flag
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BooleanLiteral
src/modules/GameWithHooks/useGame.ts:97:9
   };
 
   const handleContextMenu = (coords: Coords) => {
-    if (!gameIsStarted) setGameIsStarted(true);
+    if (gameIsStarted) setGameIsStarted(true);
     if (gameState !== GameState.ONGOING) return;
     const [newPlayerField, isSolved, flags] = setFlag(
killedBy: useGame hook Scoreboard behaviour - timer and bomb counters Timer should start by mark a cell by a flag
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Survived] ConditionalExpression
src/modules/GameWithHooks/useGame.ts:98:9
 
   const handleContextMenu = (coords: Coords) => {
     if (!gameIsStarted) setGameIsStarted(true);
-    if (gameState !== GameState.ONGOING) return;
+    if (false) return;
     const [newPlayerField, isSolved, flags] = setFlag(
       coords,

[Survived] ArrayDeclaration
src/modules/GameWithHooks/useGame.ts:107:20
       bombs
     );
     setFlagCounter(flags);
-    setPlayerField([...newPlayerField]);
+    setPlayerField([]);
   };
 

[Survived] BlockStatement
src/modules/GameWithHooks/useGame.ts:110:19
     setPlayerField([...newPlayerField]);
   };
 
-  useEffect(() => {
-    const [isSolved] = detectSolvedPuzzle(playerField, gameField);
-    if (isSolved) {
-      setPlayerField([...gameField]);
-      setGameState(GameState.WON);
-      setGameIsStarted(false);
-    }
-  }, [playerField]);
+  useEffect(() => {}, [playerField]);
 
   return {

[Timeout] ConditionalExpression
src/modules/GameWithHooks/useGame.ts:112:9
 
   useEffect(() => {
     const [isSolved] = detectSolvedPuzzle(playerField, gameField);
-    if (isSolved) {
+    if (true) {
       setPlayerField([...gameField]);
       setGameState(GameState.WON);

[NoCoverage] BlockStatement
src/modules/GameWithHooks/useGame.ts:112:19
 
   useEffect(() => {
     const [isSolved] = detectSolvedPuzzle(playerField, gameField);
-    if (isSolved) {
-      setPlayerField([...gameField]);
-      setGameState(GameState.WON);
-      setGameIsStarted(false);
-    }
+    if (isSolved) {}
   }, [playerField]);
 

[NoCoverage] BooleanLiteral
src/modules/GameWithHooks/useGame.ts:115:24
     if (isSolved) {
       setPlayerField([...gameField]);
       setGameState(GameState.WON);
-      setGameIsStarted(false);
+      setGameIsStarted(true);
     }
   }, [playerField]);

[Survived] ArrayDeclaration
src/modules/GameWithHooks/useGame.ts:117:6
       setGameState(GameState.WON);
       setGameIsStarted(false);
     }
-  }, [playerField]);
+  }, []);
 
   return {
