[Killed] StringLiteral
src/components/Grid/Cell.tsx:49:24
   background-color: #ec433c;
 `;
 
-const Flag = styled.div`
-  width: 0px;
-  height: 0px;
-  border-top: 0.5vh solid transparent;
-  border-bottom: 0.5vh solid transparent;
-  border-left: 0.5vh solid #ec433c;
-`;
+const Flag = styled.div``;
 
 const TransparentFlag = styled(Flag)`
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 12`

- Snapshot  - 1
+ Received  + 1

@@ -3,9 +3,9 @@
