[Killed] BlockStatement
ReactMineSweeper/src/helpers/DetectSolvedPuzzle.ts:8:25
 export const detectSolvedPuzzle = (
   playerField: Field,
   gameField: Field
-): [boolean, number] => {
-  let matching: number = 0;
-  const flattenPlayerField = playerField.flat();
-  const flattenGameField = gameField.flat();
-
-  const nbHidden = flattenPlayerField.filter((cell: Cell) => cell === h).length;
-  const nbBombs = flattenGameField.filter((cell: Cell) => cell === b).length;
-  const nbFlags = flattenPlayerField.filter(
-    (cell: Cell) => cell === m || cell === w
-  ).length;
-
-  for (let i = 0; i < flattenGameField.length; i++) {
-    if (flattenPlayerField[i] === m && flattenGameField[i] === b) {
-      matching++;
-    }
-  }
-  return [matching === nbBombs && nbHidden === 0, nbFlags];
-};
+): [boolean, number] => {};
 
killedBy: useGame hook Render behaviour Render game field by default
statusReason: TypeError: Invalid attempt to destructure non-iterable instance.
In order to be iterable, non-array objects must have a [Symbol.iterator]() method.

[Killed] ArrowFunction
ReactMineSweeper/src/helpers/DetectSolvedPuzzle.ts:13:46
   const flattenPlayerField = playerField.flat();
   const flattenGameField = gameField.flat();
 
-  const nbHidden = flattenPlayerField.filter((cell: Cell) => cell === h).length;
+  const nbHidden = flattenPlayerField.filter(() => undefined).length;
   const nbBombs = flattenGameField.filter((cell: Cell) => cell === b).length;
   const nbFlags = flattenPlayerField.filter(
killedBy: Detect Solved Puzzle Wrong 3x3 hidden cells case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
ReactMineSweeper/src/helpers/DetectSolvedPuzzle.ts:13:62
   const flattenPlayerField = playerField.flat();
   const flattenGameField = gameField.flat();
 
-  const nbHidden = flattenPlayerField.filter((cell: Cell) => cell === h).length;
+  const nbHidden = flattenPlayerField.filter((cell: Cell) => cell !== h).length;
   const nbBombs = flattenGameField.filter((cell: Cell) => cell === b).length;
   const nbFlags = flattenPlayerField.filter(
killedBy: setFlag action Detect win state 5x5 solved case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
ReactMineSweeper/src/helpers/DetectSolvedPuzzle.ts:14:59
   const flattenGameField = gameField.flat();
 
   const nbHidden = flattenPlayerField.filter((cell: Cell) => cell === h).length;
-  const nbBombs = flattenGameField.filter((cell: Cell) => cell === b).length;
+  const nbBombs = flattenGameField.filter((cell: Cell) => true).length;
   const nbFlags = flattenPlayerField.filter(
     (cell: Cell) => cell === m || cell === w
killedBy: Detect Solved Puzzle Simplest 3x3 case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
ReactMineSweeper/src/helpers/DetectSolvedPuzzle.ts:14:59
   const flattenGameField = gameField.flat();
 
   const nbHidden = flattenPlayerField.filter((cell: Cell) => cell === h).length;
-  const nbBombs = flattenGameField.filter((cell: Cell) => cell === b).length;
+  const nbBombs = flattenGameField.filter((cell: Cell) => cell !== b).length;
   const nbFlags = flattenPlayerField.filter(
     (cell: Cell) => cell === m || cell === w
killedBy: Detect Solved Puzzle Simplest 3x3 case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
ReactMineSweeper/src/helpers/DetectSolvedPuzzle.ts:16:35
   const nbHidden = flattenPlayerField.filter((cell: Cell) => cell === h).length;
   const nbBombs = flattenGameField.filter((cell: Cell) => cell === b).length;
   const nbFlags = flattenPlayerField.filter(
-    (cell: Cell) => cell === m || cell === w
+    (cell: Cell) => cell === m || cell !== w
   ).length;
 
killedBy: setFlag action Detect win state 5x5 solved case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 25

[Killed] LogicalOperator
ReactMineSweeper/src/helpers/DetectSolvedPuzzle.ts:16:21
   const nbHidden = flattenPlayerField.filter((cell: Cell) => cell === h).length;
   const nbBombs = flattenGameField.filter((cell: Cell) => cell === b).length;
   const nbFlags = flattenPlayerField.filter(
-    (cell: Cell) => cell === m || cell === w
+    (cell: Cell) => cell === m && cell === w
   ).length;
 
killedBy: setFlag action Detect win state 5x5 solved case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 0

[Killed] EqualityOperator
ReactMineSweeper/src/helpers/DetectSolvedPuzzle.ts:19:19
     (cell: Cell) => cell === m || cell === w
   ).length;
 
-  for (let i = 0; i < flattenGameField.length; i++) {
+  for (let i = 0; i >= flattenGameField.length; i++) {
     if (flattenPlayerField[i] === m && flattenGameField[i] === b) {
       matching++;
killedBy: setFlag action Detect win state 5x5 solved case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
ReactMineSweeper/src/helpers/DetectSolvedPuzzle.ts:19:19
     (cell: Cell) => cell === m || cell === w
   ).length;
 
-  for (let i = 0; i < flattenGameField.length; i++) {
+  for (let i = 0; false; i++) {
     if (flattenPlayerField[i] === m && flattenGameField[i] === b) {
       matching++;
killedBy: Detect Solved Puzzle Simplest 3x3 case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
ReactMineSweeper/src/helpers/DetectSolvedPuzzle.ts:20:9
   ).length;
 
   for (let i = 0; i < flattenGameField.length; i++) {
-    if (flattenPlayerField[i] === m && flattenGameField[i] === b) {
+    if (false) {
       matching++;
     }
killedBy: setFlag action Detect win state 5x5 solved case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
ReactMineSweeper/src/helpers/DetectSolvedPuzzle.ts:20:67
   ).length;
 
   for (let i = 0; i < flattenGameField.length; i++) {
-    if (flattenPlayerField[i] === m && flattenGameField[i] === b) {
-      matching++;
-    }
+    if (flattenPlayerField[i] === m && flattenGameField[i] === b) {}
   }
   return [matching === nbBombs && nbHidden === 0, nbFlags];
killedBy: setFlag action Detect win state 5x5 solved case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] UpdateOperator
ReactMineSweeper/src/helpers/DetectSolvedPuzzle.ts:21:7
 
   for (let i = 0; i < flattenGameField.length; i++) {
     if (flattenPlayerField[i] === m && flattenGameField[i] === b) {
-      matching++;
+      matching--;
     }
   }
killedBy: Detect Solved Puzzle Simplest 3x3 case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
ReactMineSweeper/src/helpers/DetectSolvedPuzzle.ts:24:35
       matching++;
     }
   }
-  return [matching === nbBombs && nbHidden === 0, nbFlags];
+  return [matching === nbBombs && true, nbFlags];
 };
 
killedBy: Detect Solved Puzzle Wrong 3x3 hidden cells case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
ReactMineSweeper/src/helpers/DetectSolvedPuzzle.ts:24:35
       matching++;
     }
   }
-  return [matching === nbBombs && nbHidden === 0, nbFlags];
+  return [matching === nbBombs && nbHidden !== 0, nbFlags];
 };
 
killedBy: Detect Solved Puzzle Simplest 3x3 case
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
