[Killed] ConditionalExpression
ReactMineSweeper/src/helpers/openCell.ts:12:7
 ) => {
   const gameCell = gameField[y][x];
 
-  if (gameCell === CellState.bomb) {
+  if (false) {
     throw new Error("Game Over");
   }
killedBy: Open cell action Simple cases with loose Open cell with the bomb
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Game Over"

Received function did not throw

[Killed] StringLiteral
ReactMineSweeper/src/helpers/openCell.ts:13:21
   const gameCell = gameField[y][x];
 
   if (gameCell === CellState.bomb) {
-    throw new Error("Game Over");
+    throw new Error("");
   }
 
killedBy: Open cell action Simple cases with loose Open cell with the bomb
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Game Over"
Received message:   ""

      76 |       } else {
      77 |         stryCov_9fa48("209");
    > 78 |         throw new Error(stryMutAct_9fa48("210") ? "" : (stryCov_9fa48("210"), "Game Over"));

[Killed] EqualityOperator
ReactMineSweeper/src/helpers/openCell.ts:16:7
     throw new Error("Game Over");
   }
 
-  if (gameCell === CellState.empty) {
+  if (gameCell !== CellState.empty) {
     playerField[y][x] = gameCell;
 
killedBy: useGame hook Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 75
Received length: 80

[Killed] BlockStatement
ReactMineSweeper/src/helpers/openCell.ts:22:48
     const items = getNeighboorsItems([y, x]);
 
     for (const coords of Object.values(items)) {
-      if (checkItemInField(coords, gameField)) {
-        const [y, x] = coords;
-        const gameCell = gameField[y][x];
-        const playerCell = playerField[y][x];
-
-        if (gameCell === CellState.empty && playerCell === CellState.hidden) {
-          // result[y][x] = gameField[y][x];
-          // emptyCells.push(coords);
-          playerField = openCell(coords, playerField, gameField);
-        }
-
-        if (gameCell < CellState.bomb) {
-          playerField[y][x] = gameCell;
-        }
-      }
+      if (checkItemInField(coords, gameField)) {}
     }
   }
killedBy: Open cell action Open empty cell Open empty cell simple 3x3 case cell
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
    Array [
      10,

[Killed] LogicalOperator
ReactMineSweeper/src/helpers/openCell.ts:27:13
         const gameCell = gameField[y][x];
         const playerCell = playerField[y][x];
 
-        if (gameCell === CellState.empty && playerCell === CellState.hidden) {
+        if (gameCell === CellState.empty || playerCell === CellState.hidden) {
           // result[y][x] = gameField[y][x];
           // emptyCells.push(coords);
killedBy: useGame hook Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 75
Received length: 0
Received array:  []

[Killed] ConditionalExpression
ReactMineSweeper/src/helpers/openCell.ts:27:13
         const gameCell = gameField[y][x];
         const playerCell = playerField[y][x];
 
-        if (gameCell === CellState.empty && playerCell === CellState.hidden) {
+        if (false) {
           // result[y][x] = gameField[y][x];
           // emptyCells.push(coords);
killedBy: Open cell action Open empty cell Open empty cell simple 3x3 case cell
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 11
+ Received  + 11

  Array [
    Array [
      10,
