[Killed] BlockStatement
ReactMineSweeper/src/helpers/setFlag.ts:12:32
   gameField: Field,
   prevFlagCounter: number,
   bombs: number
-): [Field, boolean, number] => {
-  const cell = playerField[y][x];
-  const { hidden, mark, weakMark } = CellState;
-
-  switch (cell) {
-    case mark:
-      playerField[y][x] = weakMark;
-      break;
-    case weakMark:
-      playerField[y][x] = hidden;
-      break;
-    case hidden:
-      if (prevFlagCounter < bombs) {
-        playerField[y][x] = mark;
-      }
-      break;
-  }
-
-  const [isSolved, flagCounter] = detectSolvedPuzzle(playerField, gameField);
-
-  return [playerField, isSolved, flagCounter];
-};
+): [Field, boolean, number] => {};
 
killedBy: useGame hook Scoreboard behaviour - timer and bomb counters Timer should start by mark a cell by a flag
statusReason: TypeError: Invalid attempt to destructure non-iterable instance.
In order to be iterable, non-array objects must have a [Symbol.iterator]() method.

[Killed] ConditionalExpression
ReactMineSweeper/src/helpers/setFlag.ts:17:5
   const { hidden, mark, weakMark } = CellState;
 
   switch (cell) {
-    case mark:
-      playerField[y][x] = weakMark;
-      break;
+    case mark:
     case weakMark:
       playerField[y][x] = hidden;
killedBy: setFlag action Set flag to the cell check Set flag simple 3x3 case
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
  Array [
    Array [

[Killed] ConditionalExpression
ReactMineSweeper/src/helpers/setFlag.ts:20:5
     case mark:
       playerField[y][x] = weakMark;
       break;
-    case weakMark:
-      playerField[y][x] = hidden;
-      break;
+    case weakMark:
     case hidden:
       if (prevFlagCounter < bombs) {
killedBy: setFlag action Set flag to the cell check Set flag simple 3x3 case
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
  Array [
    Array [

[Killed] ConditionalExpression
ReactMineSweeper/src/helpers/setFlag.ts:23:5
     case weakMark:
       playerField[y][x] = hidden;
       break;
-    case hidden:
-      if (prevFlagCounter < bombs) {
-        playerField[y][x] = mark;
-      }
-      break;
+    case hidden:
   }
 
killedBy: setFlag action Set flag to the cell check Set flag simple 3x3 case
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
  Array [
    Array [
