[NoCoverage] BlockStatement
Lab/ReactMineSweeper/src/App.tsx:4:16
 import React from "react";
 import "./App.css";
 
-function App() {
-  return <div className="App">coucou</div>;
-}
+function App() {}
 
 export default App;
