[Killed] BlockStatement
src/components/Game/GameOver.tsx:13:76
   isWin: boolean;
 }
 
-export const GameOver: FC<GameOverProps> = ({ onClick, isWin = false }) => {
-  return <Frame onClick={onClick}>{isWin ? "😍" : "😭"}</Frame>;
-};
+export const GameOver: FC<GameOverProps> = ({ onClick, isWin = false }) => {};
 
 const Frame = styled.div`
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: GameOver(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[NoCoverage] BooleanLiteral
src/components/Game/GameOver.tsx:13:64
   isWin: boolean;
 }
 
-export const GameOver: FC<GameOverProps> = ({ onClick, isWin = false }) => {
+export const GameOver: FC<GameOverProps> = ({ onClick, isWin = true }) => {
   return <Frame onClick={onClick}>{isWin ? "😍" : "😭"}</Frame>;
 };

[Survived] StringLiteral
src/components/Game/GameOver.tsx:17:25
   return <Frame onClick={onClick}>{isWin ? "😍" : "😭"}</Frame>;
 };
 
-const Frame = styled.div`
-  top: 50%;
-  cursor: pointer;
-  left: calc(50% - 4vw);
-  z-index: 11;
-  width: 8vw;
-  height: 8vw;
-  font-size: 4vw;
-  text-align: center;
-  position: absolute;
-  display: flex;
-  background: #ddd;
-  align-items: center;
-  justify-content: center;
-  border-radius: 50%;
-`;
+const Frame = styled.div``;
 
