[Survived] StringLiteral
src/components/ScoreBoard/ScoreBoard.tsx:7:27
 import { Level } from "./Level";
 import { Reset } from "./Reset";
 
-const Wrapper = styled.div`
-  display: flex;
-  width: max-content;
-  padding-bottom: 2vw;
-  justify-content: space-between;
-`;
+const Wrapper = styled.div``;
 
 export interface ScoreBoardProps {

[Killed] BlockStatement
src/components/ScoreBoard/ScoreBoard.tsx:46:7
   levels = [],
   onReset,
   onLevelChange,
-}) => {
-  return (
-    <Wrapper>
-      <Counter>{time}</Counter>
-      <Level onChange={onLevelChange}>{levels}</Level>
-      <Reset onReset={onReset} />
-      <Counter>{mines}</Counter>
-    </Wrapper>
-  );
-};
+}) => {};
 
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: ScoreBoard(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
