[Killed] BlockStatement
ReactMineSweeper/src/hooks/useMouseDown.ts:10:6
   boolean,
   SetMouseDownStatus,
   SetMouseUpStatus
-] => {
-  const [mouseDown, setMouseDown] = useState(false);
-
-  useDebugValue(
-    `mouseDown: ${mouseDown}`,
-    (str) => `${str} ${new Date().toISOString()}`
-  );
-
-  const onMouseDown = () => setMouseDown(true);
-  const onMouseUp = () => setMouseDown(false);
-
-  return [mouseDown, onMouseDown, onMouseUp];
-};
+] => {};
 
killedBy: Cell component check Cell renders correctly
statusReason: TypeError: Invalid attempt to destructure non-iterable instance.
In order to be iterable, non-array objects must have a [Symbol.iterator]() method.

[Survived] ArrowFunction
ReactMineSweeper/src/hooks/useMouseDown.ts:15:5
 
   useDebugValue(
     `mouseDown: ${mouseDown}`,
-    (str) => `${str} ${new Date().toISOString()}`
+    () => undefined
   );
 
