[Killed] BlockStatement
src/components/Game/GameArea.tsx:11:62
   children: ReactNode;
 }
 
-export const GameArea: FC<GameAreaProps> = ({ children }) => {
-  return <Frame>{children}</Frame>;
-};
+export const GameArea: FC<GameAreaProps> = ({ children }) => {};
 
 const Frame = styled.div`
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: GameArea(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
