[Killed] BlockStatement
src/components/Game/Wrapper.tsx:11:60
   children?: ReactNode;
 }
 
-export const Wrapper: FC<WrapperProps> = ({ children }) => {
-  return <Frame>{children}</Frame>;
-};
+export const Wrapper: FC<WrapperProps> = ({ children }) => {};
 
 const Frame = styled.div`
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: Wrapper(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Survived] StringLiteral
src/components/Game/Wrapper.tsx:15:25
   return <Frame>{children}</Frame>;
 };
 
-const Frame = styled.div`
-  position: relative;
-  display: flex;
-  align-items: center;
-  justify-content: center;
-  flex-direction: column;
-`;
+const Frame = styled.div``;
 
