[Killed] LogicalOperator
src/components/Grid/Cell.tsx:32:30
   border-color: #dddddd;
   cursor: default;
   font-size: 1em;
-  color: ${({ children }) => colors[children as CellType] ?? transparent};
+  color: ${({ children }) => colors[(children as CellType)] && transparent};
   &:hover {
     filter: brightness(1);
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 1`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>

[Killed] ArrowFunction
src/components/Grid/Cell.tsx:32:12
   border-color: #dddddd;
   cursor: default;
   font-size: 1em;
-  color: ${({ children }) => colors[children as CellType] ?? transparent};
+  color: ${() => undefined};
   &:hover {
     filter: brightness(1);
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 1`

- Snapshot  - 1
+ Received  + 1

  <DocumentFragment>

[Killed] StringLiteral
src/components/Grid/Cell.tsx:38:24
   }
 `;
 
-const Bomb = styled.div`
-  border-radius: 50%;
-  width: 1vw;
-  height: 1vw;
-  background-color: #333;
-`;
+const Bomb = styled.div``;
 
 const BombFrame = styled(RevealedFrame)`
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 10`

- Snapshot  - 1
+ Received  + 1

@@ -3,9 +3,9 @@

[Killed] StringLiteral
src/components/Grid/Cell.tsx:45:40
   background-color: #333;
 `;
 
-const BombFrame = styled(RevealedFrame)`
-  background-color: #ec433c;
-`;
+const BombFrame = styled(RevealedFrame)``;
 
 const Flag = styled.div`
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 10`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Killed] StringLiteral
src/components/Grid/Cell.tsx:49:24
   background-color: #ec433c;
 `;
 
-const Flag = styled.div`
-  width: 0px;
-  height: 0px;
-  border-top: 0.5vw solid transparent;
-  border-bottom: 0.5vw solid transparent;
-  border-left: 0.5vw solid #ec433c;
-`;
+const Flag = styled.div``;
 
 const TransparentFlag = styled(Flag)`
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 12`

- Snapshot  - 1
+ Received  + 1

@@ -3,9 +3,9 @@

[Killed] ObjectLiteral
src/components/Grid/Cell.tsx:62:45
 `;
 
 const transparent = "rgba(0,0,0,0)";
-const colors: { [k in CellType]: string } = {
-  0: "#000",
-  1: "#2a48ec",
-  2: "#2bb13d",
-  3: "#ec6561",
-  4: "#233db7",
-  5: "#a6070f",
-  6: "#e400af",
-  7: "#906a02",
-  8: "#fa0707",
-  9: transparent,
-  10: transparent,
-  11: transparent,
-  12: transparent,
-};
+const colors: { [k in CellType]: string } = {};
 
 export interface CellProps {
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 2`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Killed] StringLiteral
src/components/Grid/Cell.tsx:65:6
 const colors: { [k in CellType]: string } = {
   0: "#000",
   1: "#2a48ec",
-  2: "#2bb13d",
+  2: "",
   3: "#ec6561",
   4: "#233db7",
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 3`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Killed] StringLiteral
src/components/Grid/Cell.tsx:67:6
   1: "#2a48ec",
   2: "#2bb13d",
   3: "#ec6561",
-  4: "#233db7",
+  4: "",
   5: "#a6070f",
   6: "#e400af",
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 5`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Killed] StringLiteral
src/components/Grid/Cell.tsx:68:6
   2: "#2bb13d",
   3: "#ec6561",
   4: "#233db7",
-  5: "#a6070f",
+  5: "",
   6: "#e400af",
   7: "#906a02",
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 6`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Killed] StringLiteral
src/components/Grid/Cell.tsx:69:6
   3: "#ec6561",
   4: "#233db7",
   5: "#a6070f",
-  6: "#e400af",
+  6: "",
   7: "#906a02",
   8: "#fa0707",
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 7`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Killed] StringLiteral
src/components/Grid/Cell.tsx:71:6
   5: "#a6070f",
   6: "#e400af",
   7: "#906a02",
-  8: "#fa0707",
+  8: "",
   9: transparent,
   10: transparent,
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 9`

- Snapshot  - 1
+ Received  + 1

@@ -1,8 +1,8 @@

[Survived] OptionalChaining
src/components/Grid/Cell.tsx:115:11
   const nonActiveCellProps = {
     onContextMenu: rest.onContextMenu,
     "data-testid": rest["data-testid"],
-    role: rest?.role,
+    role: rest.role,
   };
 

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:127:5
           <Bomb />
         </BombFrame>
       );
-    case CellState.mark:
-      return (
-        <ClosedFrame {...rest}>
-          <Flag />
-        </ClosedFrame>
-      );
+    case CellState.mark:
     case CellState.weakMark:
       return (
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 12`

- Snapshot  - 1
+ Received  + 1

@@ -3,9 +3,9 @@

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:133:5
           <Flag />
         </ClosedFrame>
       );
-    case CellState.weakMark:
-      return (
-        <ClosedFrame {...rest}>
-          <TransparentFlag />
-        </ClosedFrame>
-      );
+    case CellState.weakMark:
     case CellState.hidden:
       return <ClosedFrame {...rest} />;
killedBy: Cell component check Cell renders correctly
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `Cell component check Cell renders correctly 13`

- Snapshot  - 4
+ Received  + 0

  <DocumentFragment>

[Killed] ArrowFunction
src/components/Grid/Cell.tsx:146:34
   }
 };
 
-export const checkCellIsActive = (cell: CellType): boolean =>
-  [CellState.hidden, CellState.mark, CellState.weakMark].includes(cell);
+export const checkCellIsActive = () => undefined;
 
 export const Cell: FC<CellProps> = ({ children, coords, ...rest }) => {
killedBy: Cell component check onClick and onContextMenu handler should be called for active cells
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: [1, 1]

[Killed] ArrowFunction
src/components/Grid/Cell.tsx:153:19
   const [mouseDown, onMouseDown, onMouseUp] = useMouseDown();
   const isActiveCell = checkCellIsActive(children);
 
-  const onClick = () => rest?.onClick(coords);
+  const onClick = () => undefined;
   const onContextMenu = (elem: React.MouseEvent<HTMLElement>) => {
     /**
killedBy: Cell component check onClick and onContextMenu handler should be called for active cells
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] OptionalChaining
src/components/Grid/Cell.tsx:153:25
   const [mouseDown, onMouseDown, onMouseUp] = useMouseDown();
   const isActiveCell = checkCellIsActive(children);
 
-  const onClick = () => rest?.onClick(coords);
+  const onClick = () => rest.onClick(coords);
   const onContextMenu = (elem: React.MouseEvent<HTMLElement>) => {
     /**

[Killed] BlockStatement
src/components/Grid/Cell.tsx:154:66
   const isActiveCell = checkCellIsActive(children);
 
   const onClick = () => rest?.onClick(coords);
-  const onContextMenu = (elem: React.MouseEvent<HTMLElement>) => {
-    /**
-     * Prevent context menu by default
-     */
-    elem.preventDefault();
-
-    if (isActiveCell) {
-      rest.onContextMenu(coords);
-    }
-  };
+  const onContextMenu = (elem: React.MouseEvent<HTMLElement>) => {};
 
   const props = {
killedBy: Cell component check Check preventDefault contextMenu for cell of type 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/components/Grid/Cell.tsx:160:23
      */
     elem.preventDefault();
 
-    if (isActiveCell) {
-      rest.onContextMenu(coords);
-    }
+    if (isActiveCell) {}
   };
 
killedBy: Cell component check onClick and onContextMenu handler should be called for active cells
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:160:9
      */
     elem.preventDefault();
 
-    if (isActiveCell) {
+    if (false) {
       rest.onContextMenu(coords);
     }
killedBy: Cell component check onClick and onContextMenu handler should be called for active cells
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
