[Survived] ArrowFunction
src/components/Grid/Grid.tsx:43:35
   display: grid;
   width: max-content;
   padding: 1vw;
-  grid-template-columns: repeat(${({ size }) => size}, auto);
+  grid-template-columns: repeat(${() => undefined}, auto);
 `;
 

[Killed] BlockStatement
src/components/Grid/Grid.tsx:46:78
   grid-template-columns: repeat(${({ size }) => size}, auto);
 `;
 
-export const Grid: FC<GridProps> = ({ children, onClick, onContextMenu }) => {
-  return (
-    <Wrapper size={children.length}>
-      {children.map((row, y) => {
-        return row.map((cell, x) => {
-          return (
-            <Cell
-              key={`${y}_${x}_${cell}`}
-              coords={[y, x]}
-              onClick={onClick}
-              onContextMenu={onContextMenu}
-            >
-              {cell}
-            </Cell>
-          );
-        });
-      })}
-    </Wrapper>
-  );
-};
+export const Grid: FC<GridProps> = ({ children, onClick, onContextMenu }) => {};
 
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: Grid(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
src/components/Grid/Grid.tsx:49:33
 export const Grid: FC<GridProps> = ({ children, onClick, onContextMenu }) => {
   return (
     <Wrapper size={children.length}>
-      {children.map((row, y) => {
-        return row.map((cell, x) => {
-          return (
-            <Cell
-              key={`${y}_${x}_${cell}`}
-              coords={[y, x]}
-              onClick={onClick}
-              onContextMenu={onContextMenu}
-            >
-              {cell}
-            </Cell>
-          );
-        });
-      })}
+      {children.map((row, y) => {})}
     </Wrapper>
   );
killedBy: GameWithHooks test cases Render game field by default
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "cell"

Here are the accessible roles:

  banner:

  Name "":
  <header

[Killed] BlockStatement
src/components/Grid/Grid.tsx:50:37
   return (
     <Wrapper size={children.length}>
       {children.map((row, y) => {
-        return row.map((cell, x) => {
-          return (
-            <Cell
-              key={`${y}_${x}_${cell}`}
-              coords={[y, x]}
-              onClick={onClick}
-              onContextMenu={onContextMenu}
-            >
-              {cell}
-            </Cell>
-          );
-        });
+        return row.map((cell, x) => {});
       })}
     </Wrapper>
killedBy: GameWithHooks test cases Render game field by default
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "cell"

Here are the accessible roles:

  banner:

  Name "":
  <header
