[Killed] BlockStatement
src/components/ScoreBoard/Counter.tsx:22:60
   children?: string | number;
 }
 
-export const Counter: FC<CounterProps> = ({ children }) => {
-  return <Frame>{children}</Frame>;
-};
+export const Counter: FC<CounterProps> = ({ children }) => {};
 
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: Counter(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
