[Survived] StringLiteral
src/components/ScoreBoard/Level.tsx:4:29
 import React, { FC, SyntheticEvent } from "react";
 import styled from "@emotion/styled";
 
-const Select = styled.select`
-  margin: 0;
-  height: 2.5vw;
-  border-radius: 0;
-  border: 0.15vw solid;
-  border-color: white #9e9e9e #9e9e9e white;
-  background-color: #d1d1d1;
-`;
+const Select = styled.select``;
 
 const Option = styled.option`

[Survived] StringLiteral
src/components/ScoreBoard/Level.tsx:13:29
   background-color: #d1d1d1;
 `;
 
-const Option = styled.option`
-  font-weight: normal;
-  display: block;
-  white-space: nowrap;
-  min-height: 1.2em;
-  padding: 0 0.2vw 0.2vw;
-`;
+const Option = styled.option``;
 
 export interface LevelProps {

[Killed] BlockStatement
src/components/ScoreBoard/Level.tsx:33:66
   onChange: (e: any) => void;
 }
 
-export const Level: FC<LevelProps> = ({ children, onChange }) => {
-  return (
-    <Select onChange={onChange}>
-      {children.map((c, i) => (
-        <Option key={i} value={c}>
-          {c}
-        </Option>
-      ))}
-    </Select>
-  );
-};
+export const Level: FC<LevelProps> = ({ children, onChange }) => {};
 
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: Level(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ArrowFunction
src/components/ScoreBoard/Level.tsx:36:21
 export const Level: FC<LevelProps> = ({ children, onChange }) => {
   return (
     <Select onChange={onChange}>
-      {children.map((c, i) => (
-        <Option key={i} value={c}>
-          {c}
-        </Option>
-      ))}
+      {children.map(() => undefined)}
     </Select>
   );
killedBy: GameWithHooks test cases Change level works fine
statusReason: TestingLibraryElementError: Value "intermediate" not found in options

Ignored nodes: comments, <script />, <style />
<select
  class="css-55qvia"
/>
