[Survived] StringLiteral
src/components/ScoreBoard/Reset.tsx:6:29
 
 import { useMouseDown } from "@/hooks/useMouseDown";
 
-const Button = styled.button`
-  font-size: 1.5vw;
-  cursor: pointer;
-  font-weight: 700;
-  border-width: 0.15vw;
-  border-style: solid;
-  background-color: #d1d1d1;
-  border-color: white #9e9e9e #9e9e9e white;
-`;
+const Button = styled.button``;
 
 export interface ResetProps {

[Killed] BlockStatement
src/components/ScoreBoard/Reset.tsx:23:55
   onReset: () => void;
 }
 
-export const Reset: FC<ResetProps> = ({ onReset }) => {
-  const [mouseDown, onMouseDown, onMouseUp] = useMouseDown();
-
-  return (
-    <Button
-      onMouseDown={onMouseDown}
-      onMouseUp={onMouseUp}
-      onMouseLeave={onMouseUp}
-      onClick={onReset}
-    >
-      {mouseDown ? "😮" : "🙃"}
-    </Button>
-  );
-};
+export const Reset: FC<ResetProps> = ({ onReset }) => {};
 
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: Reset(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
