[Survived] StringLiteral
components/Top/Legend/Legend.tsx:29:32
   background-color: #e3e3e3;
 `;
 
-const FirstAction = styled.span`
-  color: #ec433c;
-`;
+const FirstAction = styled.span``;
 
 const SecondAction = styled.span`

[Survived] StringLiteral
components/Top/Legend/Legend.tsx:33:33
   color: #ec433c;
 `;
 
-const SecondAction = styled.span`
-  color: #2a48ec;
-`;
+const SecondAction = styled.span``;
 
 export const Legend: FC<LegendProps> = ({

[Survived] StringLiteral
components/Top/Legend/Legend.tsx:38:13
 `;
 
 export const Legend: FC<LegendProps> = ({
-  feature = "Flag",
+  feature = "",
   firstAction = "Ctrl",
   secondAction = "Click",

[Survived] StringLiteral
components/Top/Legend/Legend.tsx:39:17
 
 export const Legend: FC<LegendProps> = ({
   feature = "Flag",
-  firstAction = "Ctrl",
+  firstAction = "",
   secondAction = "Click",
 }: LegendProps) => {

[Killed] BlockStatement
components/Top/Legend/Legend.tsx:41:20
   feature = "Flag",
   firstAction = "Ctrl",
   secondAction = "Click",
-}: LegendProps) => {
-  return (
-    <Parent>
-      <strong>{feature}: </strong>
-      <FlagComboParent>
-        <FirstAction>{firstAction}</FirstAction> +{" "}
-        <SecondAction>{secondAction}</SecondAction>
-      </FlagComboParent>
-    </Parent>
-  );
-};
+}: LegendProps) => {};
 
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: Legend(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Survived] StringLiteral
components/Top/Legend/Legend.tsx:46:52
     <Parent>
       <strong>{feature}: </strong>
       <FlagComboParent>
-        <FirstAction>{firstAction}</FirstAction> +{" "}
+        <FirstAction>{firstAction}</FirstAction> +{""}
         <SecondAction>{secondAction}</SecondAction>
       </FlagComboParent>
