[Survived] StringLiteral
src/components/Top/Top.tsx:7:29
 import { Legend, LegendProps } from "./Legend/Legend";
 import { GameName, GameNameProps } from "./GameName/GameName";
 
-const Header = styled.header`
-  text-align: center;
-  position: relative;
-  display: inline-block;
-`;
+const Header = styled.header``;
 
 export const Top: FC<LegendProps & GameNameProps> = ({

[Killed] BlockStatement
src/components/Top/Top.tsx:16:7
 export const Top: FC<LegendProps & GameNameProps> = ({
   children,
   ...otherProps
-}) => {
-  return (
-    <Header>
-      <GameName>{children}</GameName>
-      <Legend {...otherProps} />
-    </Header>
-  );
-};
+}) => {};
 
killedBy: GameWithHooks test cases Render game field by default
statusReason: Error: Top(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
