[Killed] BlockStatement
ReactMineSweeper/src/helpers/CellsManipulator.ts:3:77
 import { Cell, Coords, Field, CellState } from "./Field";
 
-export const incrementNeighboors = (coords: Coords, field: Field): Field => {
-  const items = getNeighboorsItems(coords);
-
-  for (const item of Object.values(items)) {
-    if (checkItemInField(item, field)) {
-      const [y, x] = item;
-      const cell = field[y][x];
-
-      if (cell < 8) {
-        field[y][x] = (cell + 1) as Cell;
-      }
-    }
-  }
-  return field;
-};
+export const incrementNeighboors = (coords: Coords, field: Field): Field => {};
 
 export const getNeighboorsItems = (coords: Coords): Record<string, Coords> => {
killedBy: Check increment neighboors Simple Cases Field with only one item
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [[9]]
Received: undefined

[Killed] BlockStatement
ReactMineSweeper/src/helpers/CellsManipulator.ts:6:44
 export const incrementNeighboors = (coords: Coords, field: Field): Field => {
   const items = getNeighboorsItems(coords);
 
-  for (const item of Object.values(items)) {
-    if (checkItemInField(item, field)) {
-      const [y, x] = item;
-      const cell = field[y][x];
-
-      if (cell < 8) {
-        field[y][x] = (cell + 1) as Cell;
-      }
-    }
-  }
+  for (const item of Object.values(items)) {}
   return field;
 };
killedBy: Check increment neighboors Simple Cases Field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      9,

[Killed] BlockStatement
ReactMineSweeper/src/helpers/CellsManipulator.ts:11:21
       const [y, x] = item;
       const cell = field[y][x];
 
-      if (cell < 8) {
-        field[y][x] = (cell + 1) as Cell;
-      }
+      if (cell < 8) {}
     }
   }
killedBy: Check increment neighboors Simple Cases Field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      9,

[Killed] ConditionalExpression
ReactMineSweeper/src/helpers/CellsManipulator.ts:11:11
       const [y, x] = item;
       const cell = field[y][x];
 
-      if (cell < 8) {
+      if (false) {
         field[y][x] = (cell + 1) as Cell;
       }
killedBy: Check increment neighboors Simple Cases Field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      9,

[Killed] BlockStatement
ReactMineSweeper/src/helpers/CellsManipulator.ts:19:79
   return field;
 };
 
-export const getNeighboorsItems = (coords: Coords): Record<string, Coords> => {
-  const [y, x] = coords;
-
-  return {
-    top: [y - 1, x],
-    topRight: [y - 1, x + 1],
-    right: [y, x + 1],
-    rightBottom: [y + 1, x + 1],
-    bottom: [y + 1, x],
-    bottomLeft: [y + 1, x - 1],
-    left: [y, x - 1],
-    leftTop: [y - 1, x - 1],
-  };
-};
+export const getNeighboorsItems = (coords: Coords): Record<string, Coords> => {};
 
 export const checkItemInField = ([y, x]: Coords, field: Field) => {
killedBy: Check increment neighboors Simple Cases Field with only one item
statusReason: TypeError: Cannot convert undefined or null to object

[Killed] ArithmeticOperator
ReactMineSweeper/src/helpers/CellsManipulator.ts:23:11
   const [y, x] = coords;
 
   return {
-    top: [y - 1, x],
+    top: [y + 1, x],
     topRight: [y - 1, x + 1],
     right: [y, x + 1],
killedBy: Check increment neighboors Simple Cases Field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2,9 +2,9 @@
    Array [
      9,

[Killed] BlockStatement
ReactMineSweeper/src/helpers/CellsManipulator.ts:34:67
   };
 };
 
-export const checkItemInField = ([y, x]: Coords, field: Field) => {
-  return field?.[y]?.[x] !== undefined;
-};
+export const checkItemInField = ([y, x]: Coords, field: Field) => {};
 
 export const openCell = (
killedBy: Check increment neighboors Simple Cases Field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      9,

[Killed] EqualityOperator
ReactMineSweeper/src/helpers/CellsManipulator.ts:35:10
 };
 
 export const checkItemInField = ([y, x]: Coords, field: Field) => {
-  return field?.[y]?.[x] !== undefined;
+  return field?.[y]?.[x] === undefined;
 };
 
killedBy: Check increment neighboors Simple Cases Field with only one item
statusReason: TypeError: Cannot read property '0' of undefined

[Killed] ConditionalExpression
ReactMineSweeper/src/helpers/CellsManipulator.ts:35:10
 };
 
 export const checkItemInField = ([y, x]: Coords, field: Field) => {
-  return field?.[y]?.[x] !== undefined;
+  return true;
 };
 
killedBy: Check increment neighboors Simple Cases Field with only one item
statusReason: TypeError: Cannot read property '0' of undefined

[Killed] ConditionalExpression
ReactMineSweeper/src/helpers/CellsManipulator.ts:45:7
 ) => {
   const gameCell = gameField[y][x];
 
-  if (gameCell === CellState.bomb) {
+  if (true) {
     throw new Error("Game Over");
   }
killedBy: Open cell action Open cell with number Open cell with state = 1
statusReason: Error: Game Over

[Killed] EqualityOperator
ReactMineSweeper/src/helpers/CellsManipulator.ts:45:7
 ) => {
   const gameCell = gameField[y][x];
 
-  if (gameCell === CellState.bomb) {
+  if (gameCell !== CellState.bomb) {
     throw new Error("Game Over");
   }
killedBy: Open cell action Simple cases with loose Open cell with the bomb
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Game Over"

Received function did not throw

[Killed] ConditionalExpression
ReactMineSweeper/src/helpers/CellsManipulator.ts:49:7
     throw new Error("Game Over");
   }
 
-  if (gameCell === CellState.empty) {
+  if (true) {
     playerField[y][x] = gameCell;
 
killedBy: Open cell action Open cell with number Open cell with state = 1
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 7
+ Received  + 7

  Array [
    Array [
-     10,

[Killed] ConditionalExpression
ReactMineSweeper/src/helpers/CellsManipulator.ts:49:7
     throw new Error("Game Over");
   }
 
-  if (gameCell === CellState.empty) {
+  if (false) {
     playerField[y][x] = gameCell;
 
killedBy: useGame hook Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 75
Received length: 80

[Killed] BlockStatement
ReactMineSweeper/src/helpers/CellsManipulator.ts:54:48
 
     const items = getNeighboorsItems([y, x]);
 
-    for (const coords of Object.values(items)) {
-      if (checkItemInField(coords, gameField)) {
-        const [y, x] = coords;
-        const gameCell = gameField[y][x];
-        const playerCell = playerField[y][x];
-
-        if (gameCell === CellState.empty && playerCell === CellState.hidden) {
-          // result[y][x] = gameField[y][x];
-          // emptyCells.push(coords);
-          playerField = openCell(coords, playerField, gameField);
-        }
-
-        if (gameCell < CellState.bomb) {
-          playerField[y][x] = gameCell;
-        }
-      }
-    }
+    for (const coords of Object.values(items)) {}
   }
 
killedBy: Open cell action Open empty cell Open empty cell simple 3x3 case cell
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
    Array [
      10,

[Killed] ConditionalExpression
ReactMineSweeper/src/helpers/CellsManipulator.ts:55:11
     const items = getNeighboorsItems([y, x]);
 
     for (const coords of Object.values(items)) {
-      if (checkItemInField(coords, gameField)) {
+      if (true) {
         const [y, x] = coords;
         const gameCell = gameField[y][x];
killedBy: Open cell action Open empty cell Open empty cell simple 3x3 case cell
statusReason: TypeError: Cannot read property '2' of undefined

[Killed] ConditionalExpression
ReactMineSweeper/src/helpers/CellsManipulator.ts:55:11
     const items = getNeighboorsItems([y, x]);
 
     for (const coords of Object.values(items)) {
-      if (checkItemInField(coords, gameField)) {
+      if (false) {
         const [y, x] = coords;
         const gameCell = gameField[y][x];
killedBy: Open cell action Open empty cell Open empty cell simple 3x3 case cell
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
    Array [
      10,

[Killed] BlockStatement
ReactMineSweeper/src/helpers/CellsManipulator.ts:60:78
         const gameCell = gameField[y][x];
         const playerCell = playerField[y][x];
 
-        if (gameCell === CellState.empty && playerCell === CellState.hidden) {
-          // result[y][x] = gameField[y][x];
-          // emptyCells.push(coords);
-          playerField = openCell(coords, playerField, gameField);
-        }
+        if (gameCell === CellState.empty && playerCell === CellState.hidden) {}
 
         if (gameCell < CellState.bomb) {
killedBy: useGame hook Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 75
Received length: 77

[Killed] ConditionalExpression
ReactMineSweeper/src/helpers/CellsManipulator.ts:60:45
         const gameCell = gameField[y][x];
         const playerCell = playerField[y][x];
 
-        if (gameCell === CellState.empty && playerCell === CellState.hidden) {
+        if (gameCell === CellState.empty && true) {
           // result[y][x] = gameField[y][x];
           // emptyCells.push(coords);
killedBy: useGame hook Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 75
Received length: 77

[Killed] EqualityOperator
ReactMineSweeper/src/helpers/CellsManipulator.ts:66:13
           playerField = openCell(coords, playerField, gameField);
         }
 
-        if (gameCell < CellState.bomb) {
+        if (gameCell <= CellState.bomb) {
           playerField[y][x] = gameCell;
         }
killedBy: Open cell action Open empty cell Open empty cell simple 3x3 case cell
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -6,11 +6,11 @@
      1,
      2,

[Killed] ConditionalExpression
ReactMineSweeper/src/helpers/CellsManipulator.ts:66:13
           playerField = openCell(coords, playerField, gameField);
         }
 
-        if (gameCell < CellState.bomb) {
+        if (true) {
           playerField[y][x] = gameCell;
         }
killedBy: Open cell action Open empty cell Open empty cell simple 3x3 case cell
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -6,11 +6,11 @@
      1,
      2,
