[Killed] BlockStatement
ReactMineSweeper/src/helpers/Field.ts:18:13
 export const emptyFieldGenerator = (
   size: number,
   state: Cell = CellState.empty
-): Field => {
-  return new Array(size).fill(null).map(() => new Array(size).fill(state));
-};
+): Field => {};
 
 export const fieldGenerator = (size: number, probability: number): Field => {
killedBy: FieldGenerator Empty FieldGenerator 2x2
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [[0, 0], [0, 0]]
Received: undefined

[Killed] ArrowFunction
ReactMineSweeper/src/helpers/Field.ts:19:41
   size: number,
   state: Cell = CellState.empty
 ): Field => {
-  return new Array(size).fill(null).map(() => new Array(size).fill(state));
+  return new Array(size).fill(null).map(() => undefined);
 };
 
killedBy: FieldGenerator Empty FieldGenerator 2x2
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 2

  Array [
-   Array [
-     0,

[Killed] ArrayDeclaration
ReactMineSweeper/src/helpers/Field.ts:19:10
   size: number,
   state: Cell = CellState.empty
 ): Field => {
-  return new Array(size).fill(null).map(() => new Array(size).fill(state));
+  return new Array().fill(null).map(() => new Array(size).fill(state));
 };
 
killedBy: FieldGenerator Empty FieldGenerator 2x2
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Array [
-   Array [
-     0,

[Killed] BlockStatement
ReactMineSweeper/src/helpers/Field.ts:22:77
   return new Array(size).fill(null).map(() => new Array(size).fill(state));
 };
 
-export const fieldGenerator = (size: number, probability: number): Field => {
-  if (probability < 0 || probability > 1) {
-    throw new Error("Probability must be between 0 and 1");
-  }
-
-  let unprocessedCells = size * size;
-  let restCellsWithBombs = unprocessedCells * probability;
-
-  let result: Field = emptyFieldGenerator(size);
-
-  for (let i = 0; i < size; i++) {
-    for (let j = 0; j < size; j++) {
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
-        result[i][j] = CellState.bomb;
-        incrementNeighboors([i, j], result);
-        restCellsWithBombs--;
-      }
-      unprocessedCells--;
-    }
-  }
-
-  return result;
-};
+export const fieldGenerator = (size: number, probability: number): Field => {};
 
killedBy: FieldGenerator Simple cases Wrong density
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Probability must be between 0 and 1"

Received function did not throw

[Killed] ConditionalExpression
ReactMineSweeper/src/helpers/Field.ts:23:7
 };
 
 export const fieldGenerator = (size: number, probability: number): Field => {
-  if (probability < 0 || probability > 1) {
+  if (false) {
     throw new Error("Probability must be between 0 and 1");
   }
killedBy: FieldGenerator Simple cases Wrong density
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Probability must be between 0 and 1"

Received function did not throw

[Killed] BlockStatement
ReactMineSweeper/src/helpers/Field.ts:32:34
 
   let result: Field = emptyFieldGenerator(size);
 
-  for (let i = 0; i < size; i++) {
-    for (let j = 0; j < size; j++) {
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
-        result[i][j] = CellState.bomb;
-        incrementNeighboors([i, j], result);
-        restCellsWithBombs--;
-      }
-      unprocessedCells--;
-    }
-  }
+  for (let i = 0; i < size; i++) {}
 
   return result;
killedBy: FieldGenerator Simple cases Smallest possible field with mines
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] BlockStatement
ReactMineSweeper/src/helpers/Field.ts:34:66
 
   for (let i = 0; i < size; i++) {
     for (let j = 0; j < size; j++) {
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
-        result[i][j] = CellState.bomb;
-        incrementNeighboors([i, j], result);
-        restCellsWithBombs--;
-      }
+      if (restCellsWithBombs / unprocessedCells > Math.random()) {}
       unprocessedCells--;
     }
killedBy: FieldGenerator Simple cases Smallest possible field with mines
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Survived] ArrayDeclaration
ReactMineSweeper/src/helpers/Field.ts:36:29
     for (let j = 0; j < size; j++) {
       if (restCellsWithBombs / unprocessedCells > Math.random()) {
         result[i][j] = CellState.bomb;
-        incrementNeighboors([i, j], result);
+        incrementNeighboors([], result);
         restCellsWithBombs--;
       }

[Killed] UpdateOperator
ReactMineSweeper/src/helpers/Field.ts:37:9
       if (restCellsWithBombs / unprocessedCells > Math.random()) {
         result[i][j] = CellState.bomb;
         incrementNeighboors([i, j], result);
-        restCellsWithBombs--;
+        restCellsWithBombs++;
       }
       unprocessedCells--;
killedBy: FieldGenerator Simple cases 2x2 field with 50% probability
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3
Received array:  [9, 9, 9]
