[Killed] EqualityOperator
src/modules/GameWithHooks/GameWithHooks.tsx:39:10
           onLevelChange={handleChangeLevel}
           onReset={handleReset}
         />
-        {gameState !== GameState.ONGOING && (
+        {gameState === GameState.ONGOING && (
           <GameOver onClick={handleReset} isWin={gameState === GameState.WON} />
         )}
killedBy: GameWithHooks test cases Game over reset the game state
statusReason: TestingLibraryElementError: Unable to find an element with the text: 😭. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="css-1ct4owg"
    >

[Killed] LogicalOperator
src/modules/GameWithHooks/GameWithHooks.tsx:39:10
           onLevelChange={handleChangeLevel}
           onReset={handleReset}
         />
-        {gameState !== GameState.ONGOING && (
-          <GameOver onClick={handleReset} isWin={gameState === GameState.WON} />
-        )}
+        {gameState !== GameState.ONGOING || <GameOver onClick={handleReset} isWin={gameState === GameState.WON} />}
         <Grid onClick={handleClick} onContextMenu={() => {}}>
           {playerField}
killedBy: GameWithHooks test cases Game over reset the game state
statusReason: TestingLibraryElementError: Unable to find an element with the text: 😭. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="css-1ct4owg"
    >

[Killed] EqualityOperator
src/modules/GameWithHooks/GameWithHooks.tsx:40:50
           onReset={handleReset}
         />
         {gameState !== GameState.ONGOING && (
-          <GameOver onClick={handleReset} isWin={gameState === GameState.WON} />
+          <GameOver onClick={handleReset} isWin={gameState !== GameState.WON} />
         )}
         <Grid onClick={handleClick} onContextMenu={() => {}}>
killedBy: GameWithHooks test cases Game over reset the game state
statusReason: TestingLibraryElementError: Unable to find an element with the text: 😭. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="css-1ct4owg"
    >

[Killed] ConditionalExpression
src/modules/GameWithHooks/GameWithHooks.tsx:40:50
           onReset={handleReset}
         />
         {gameState !== GameState.ONGOING && (
-          <GameOver onClick={handleReset} isWin={gameState === GameState.WON} />
+          <GameOver onClick={handleReset} isWin={true} />
         )}
         <Grid onClick={handleClick} onContextMenu={() => {}}>
killedBy: GameWithHooks test cases Game over reset the game state
statusReason: TestingLibraryElementError: Unable to find an element with the text: 😭. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="css-1ct4owg"
    >
