[Killed] ObjectLiteral
src/modules/GameWithHooks/GameSettings.tsx:7:59
 
 export type Settings = [number, number];
 
-export const GameSettings: Record<LevelNames, Settings> = {
-  beginner: [9, 10],
-  intermediate: [16, 44],
-  expert: [22, 99],
-};
+export const GameSettings: Record<LevelNames, Settings> = {};
 
killedBy: useGame hook Render behaviour Render game field by default
statusReason: TypeError: Invalid attempt to destructure non-iterable instance.
In order to be iterable, non-array objects must have a [Symbol.iterator]() method.

[Killed] ArrayDeclaration
src/modules/GameWithHooks/GameSettings.tsx:9:17
 
 export const GameSettings: Record<LevelNames, Settings> = {
   beginner: [9, 10],
-  intermediate: [16, 44],
+  intermediate: [],
   expert: [22, 99],
 };
killedBy: useGame hook Render behaviour onChange game level handler
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 16
Received length: 1
Received array:  [[10]]

[Killed] ArrayDeclaration
src/modules/GameWithHooks/GameSettings.tsx:10:11
 export const GameSettings: Record<LevelNames, Settings> = {
   beginner: [9, 10],
   intermediate: [16, 44],
-  expert: [22, 99],
+  expert: [],
 };
 
killedBy: useGame hook Render behaviour onChange game level handler
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 22
Received length: 1
Received array:  [[10]]
