[Killed] ArrowFunction
src/modules/GameWithHooks/useGame.ts:36:5
   let initialPlayerField: Field = emptyFieldGenerator(size, CellState.hidden);
   const [playerField, setPlayerField] = useState<Field>(initialPlayerField);
   let gameField: Field = useMemo(
-    () => fieldGenerator(size, bombs / (size * size)),
+    () => undefined,
     [size, bombs, reset]
   );
killedBy: useGame hook Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 75
Received length: 81

[Survived] ArithmeticOperator
src/modules/GameWithHooks/useGame.ts:36:41
   let initialPlayerField: Field = emptyFieldGenerator(size, CellState.hidden);
   const [playerField, setPlayerField] = useState<Field>(initialPlayerField);
   let gameField: Field = useMemo(
-    () => fieldGenerator(size, bombs / (size * size)),
+    () => fieldGenerator(size, bombs / (size / size)),
     [size, bombs, reset]
   );

[Survived] ArrayDeclaration
src/modules/GameWithHooks/useGame.ts:37:5
   const [playerField, setPlayerField] = useState<Field>(initialPlayerField);
   let gameField: Field = useMemo(
     () => fieldGenerator(size, bombs / (size * size)),
-    [size, bombs, reset]
+    []
   );
 

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:40:43
     [size, bombs, reset]
   );
 
-  const handleClick = (coords: Coords) => {
-    if (gameState !== GameState.ONGOING) return;
-    try {
-      const newPlayerField = openCell(coords, playerField, gameField);
-      setPlayerField([...newPlayerField]);
-    } catch (e) {
-      setGameState(GameState.LOST);
-    }
-  };
+  const handleClick = (coords: Coords) => {};
 
   const createNewPlayerField = (level: LevelNames) => {
killedBy: useGame hook Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 75
Received length: 81

[Killed] ConditionalExpression
src/modules/GameWithHooks/useGame.ts:41:9
   );
 
   const handleClick = (coords: Coords) => {
-    if (gameState !== GameState.ONGOING) return;
+    if (true) return;
     try {
       const newPlayerField = openCell(coords, playerField, gameField);
killedBy: useGame hook Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 75
Received length: 81

[Killed] EqualityOperator
src/modules/GameWithHooks/useGame.ts:41:9
   );
 
   const handleClick = (coords: Coords) => {
-    if (gameState !== GameState.ONGOING) return;
+    if (gameState === GameState.ONGOING) return;
     try {
       const newPlayerField = openCell(coords, playerField, gameField);
killedBy: useGame hook Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 75
Received length: 81

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:42:9
 
   const handleClick = (coords: Coords) => {
     if (gameState !== GameState.ONGOING) return;
-    try {
-      const newPlayerField = openCell(coords, playerField, gameField);
-      setPlayerField([...newPlayerField]);
-    } catch (e) {
+    try {} catch (e) {
       setGameState(GameState.LOST);
     }
killedBy: useGame hook Open cell test cases Open empty cell on the beginner level
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 75
Received length: 81

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:45:17
     try {
       const newPlayerField = openCell(coords, playerField, gameField);
       setPlayerField([...newPlayerField]);
-    } catch (e) {
-      setGameState(GameState.LOST);
-    }
+    } catch (e) {}
   };
 
killedBy: useGame hook Game over behavior Player loose the game
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: 2
Received: 0

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:50:55
     }
   };
 
-  const createNewPlayerField = (level: LevelNames) => {
-    const [size] = GameSettings[level];
-    const newPlayerField = emptyFieldGenerator(size, CellState.hidden);
-    setPlayerField([...newPlayerField]);
-  };
+  const createNewPlayerField = (level: LevelNames) => {};
 
   const handleChangeLevel = ({ target: { value: level = GameLevels[0] } }) => {
killedBy: useGame hook Render behaviour onChange game level handler
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 16
Received length: 9

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:56:79
     setPlayerField([...newPlayerField]);
   };
 
-  const handleChangeLevel = ({ target: { value: level = GameLevels[0] } }) => {
-    setLevel(level);
-    createNewPlayerField(level);
-  };
+  const handleChangeLevel = ({ target: { value: level = GameLevels[0] } }) => {};
 
   const handleReset = () => {
killedBy: useGame hook Render behaviour onChange game level handler
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 16
Received length: 9

[Killed] BlockStatement
src/modules/GameWithHooks/useGame.ts:61:29
     createNewPlayerField(level);
   };
 
-  const handleReset = () => {
-    setReset(reset + 1);
-    setGameState(GameState.ONGOING);
-    createNewPlayerField(level);
-  };
+  const handleReset = () => {};
 
   return {
killedBy: useGame hook onReset game handler
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 81
Received length: 75

[Survived] ArithmeticOperator
src/modules/GameWithHooks/useGame.ts:62:14
   };
 
   const handleReset = () => {
-    setReset(reset + 1);
+    setReset(reset - 1);
     setGameState(GameState.ONGOING);
     createNewPlayerField(level);
